# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPs
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone (sau khi nhân width multiplier 0.25)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]      # 0-P1/2     · 320×320×16
  - [-1, 1, Conv, [32, 3, 2]]      # 1-P2/4     · 160×160×32
  - [-1, 3, C2f, [32, True]]       # 2          · 160×160×32
  - [-1, 1, Conv, [64, 3, 2]]      # 3-P3/8     · 80×80×64
  - [-1, 6, C2f, [64, True]]       # 4          · 80×80×64
  - [-1, 1, Conv, [128, 3, 2]]     # 5-P4/16    · 40×40×128
  - [-1, 6, C2f, [128, True]]      # 6          · 40×40×128
  - [-1, 1, Conv, [256, 3, 2]]     # 7-P5/32    · 20×20×256
  - [-1, 3, C2f, [256, True]]      # 8          · 20×20×256
  - [-1, 1, SPPF, [256, 5]]        # 9          · 20×20×256

# YOLOv8.0-P2 head
head:
  # ----- P5-P4 fusion -----
  - [-1, 1, Conv, [128, 1, 1]]     # 10         · 20×20×128    (512→128)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11   · 40×40×128
  - [[-1, 6], 1, BiFPN_Concat, [64, 64]]         # 12         · Fusion: 40×40 (128 from upsample + 128 from backbone layer 6) → output 64 channels
  - [-1, 3, C2f, [128]]            # 13         · 40×40×128

  # ----- P4-P3 fusion -----
  - [-1, 1, Conv, [64, 1, 1]]      # 14         · 40×40×64     (256→64)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15   · 80×80×64
  - [[-1, 4], 1, BiFPN_Concat, [32, 32]]         # 16         · Fusion: 80×80 (64 from upsample + 64 from backbone layer 4) → output 32 channels
  - [-1, 3, C2f, [64]]             # 17         · 80×80×64

  # ----- P3-P2 fusion -----
  - [-1, 1, Conv, [32, 1, 1]]      # 18         · 80×80×32     (128→32)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19   · 160×160×32
  - [[-1, 2], 1, BiFPN_Concat, [16, 16]]         # 20         · Fusion: 160×160 (32 from upsample + 32 from backbone layer 2) → output 16 channels
  - [-1, 3, C2f, [32]]             # 21         · 160×160×32

  # ----- Head P3 branch -----
  - [-1, 1, Conv, [32, 3, 2]]      # 22         · 80×80×32     (Downsample from P2 branch)
  - [[-1, 18], 1, BiFPN_Concat, [16, 16]]         # 23         · Fusion in head: 80×80 → output 16 channels
  - [-1, 3, C2f, [64]]             # 24         · 80×80×64

  # ----- Head P4 branch -----
  - [-1, 1, Conv, [64, 3, 2]]      # 25         · 40×40×64     (Downsample from head branch)
  - [[-1, 14], 1, BiFPN_Concat, [32, 32]]         # 26         · Fusion in head: 40×40 → output 32 channels
  - [-1, 3, C2f, [128]]            # 27         · 40×40×128

  # ----- Detect -----
  - [[21, 24, 27], 1, Detect, [nc]]  # Detect(P2, P3, P4)
